configs/llm_serial/gemma-3n-E4B-it_demo_run.yaml
# Configuration for Serial Benchmark Runner - gemma-3n-E4B-it on demo QA pairs

experiment:
  name: "gemma-3n-E4B-it_demo_run"
  description: "Benchmark google/gemma-3n-E4B-it on demo QA pairs"

input:
  qa_pairs_csv: "/workspace/data/qa/demo_run/qa_pairs.csv"

output:
  output_dir: "/workspace/data/results/demo_run/gemma-3n-E4B-it"

model:
  provider: "togetherai"
  temperature: 0.0
  max_tokens: 200

models:
  - "google/gemma-3n-E4B-it"

execution:
  strategy: "row_by_row"
  batch_size: 10
  max_concurrency: 10

# Note: Requires TOGETHERAI_API_KEY in environment or API_KEY/TOGETHERAI_API_KEY file