configs/llm_serial/gpt4o_demo_run.yaml
# Configuration for Serial Benchmark Runner - GPT-4o on sample QA pairs

experiment:
  name: "gpt4o_demo_run"
  description: "Benchmark GPT-4o on sample QA pairs"

input:
  # Path to the QA pairs file
  qa_pairs_csv: "/workspace/data/qa/demo_run/qa_pairs.csv"

output:
  # Directory for results
  output_dir: "/workspace/data/results/demo_run/gpt-4o"

model:
  # Model provider configuration
  provider: "openai"  # Options: openai, groq, nebius
  temperature: 0.0
  max_tokens: 200

models:
  - "gpt-4o"

execution:
  # Execution strategy: 'model_by_model' or 'row_by_row'
  strategy: "row_by_row"

  # Number of rows to process before saving checkpoint
  batch_size: 10

  # Maximum concurrent requests (async semaphore)
  max_concurrency: 10

# Note: API keys should be set as environment variables:
# - OPENAI_API_KEY (for provider: openai)
# - GROQ_API_KEY (for provider: groq)
# - NEBIUS_API_KEY (for provider: nebius)